import React from "react";
import { Link } from "react-router-dom";
import { DocumentTextIcon, ShieldExclamationIcon, ChevronLeftIcon } from "@heroicons/react/24/outline";

const LegalInfo = () => {
  

  
  return (
    <div className="bg-gray-50 min-h-screen p-6 flex justify-center">
      <div className="bg-white rounded-2xl shadow-md border p-8 max-w-4xl w-full text-right leading-relaxed">
        <h1 className="text-3xl font-bold text-gray-800 mb-6">
          الشروط والأحكام
        </h1>

        <p className="text-gray-700 whitespace-pre-line text-lg">
          تطبيق مزاد الفريج يعمل كوسيط بين الطرفين (البائع - المشتري) بحيث يتيح للراغبين ببيع مركباتهم وعرضها في التطبيق،
          ويكون للراغب بالشراء خيار المزايدة على المركبات، حيث يتم استلام المركبات وعرضها وفتح باب المزايدة عليه خلال أوقات
          تحددها الشركة وفقا لهذه الشروط والاحكام ويعتبر البيع من خلال مزاد الفريج الالكتروني بيعا شرعيا يلزم توافر الايجاب
          والقبول فيه، تعتبر المزايد إيجاب للرغبة بالشراء، ويجب أن يقبل البائع مبلغ المزايدة الاخير ليعتبر قبول لعقد البيع و
          إتمامه.

          {"\n\n"}يقر المستخدم ان تطبيق مزاد الفريج ليس مالكا للمركبات المعروضة على المنصة، وماهي إلا وسيط إلكتروني بين
          البائع والمشتري لتسهيل عملية البيع واقتصار دورها على السعي وتنظيم المزاد فقط.

          {"\n\n"}🔹 شروط وأحكام استخدام الخدمة

          {"\n\n"}🟩 التزامات البائع فيما يخص البيع:
          {"\n"}• صورة من استمارة المركبة سارية المفعول مدة أقصاها شهر
          {"\n"}• صورة من هوية البائع
          {"\n"}• مفتاح المركبة
          {"\n"}• الفحص ساري المفعول مدة أقصاها شهر بالإضافة الى خلوها من مخالفات هيئة النقل والمرور.

          {"\n\n"}إذا رفض البائع البيع اثناء الحراج والمزاد يتم سحب المركبة من ساحة المزاد خلال يوم عمل من قرار الرفض،
          وإذا لم يتم سحب المركبة خلال المدة المحددة للبائع 24 ساعة يتم سحب 50 ريال لكل يوم او جزء من اليوم كرسوم إيواء.

          {"\n\n"}بعد نقل الملكية للمركبة من قبل المشتري يتم تحويل المبلغ الى البائع.
          {"\n"}يترتب على البائع دفع مبلغ 250 ريال رسوم مزاد أو اعلان المركبة في التطبيق.

          {"\n\n"}🟩 التزامات المشتري فيما يخص الشراء:
          {"\n"}• يتم منح المشتري مهلة ثلاثة أيام عمل لسداد قيمة المركبة بالإضافة الى دفع كامل الرسوم والعمولات المستحقة للشركة
          وإذا لم يتم السداد في الوقت المحدد يلغى البيع و يصادر مبلغ السعي وعدم المطالبة به بتاتا.
          {"\n"}• يتم السداد من حساب بنكي مسجل باسمه في أحد البنوك السعودية مع كتابة سبب التحويل على سبيل المثال قيمة (شراء سيارة).
          {"\n"}• ويتم تحويل مبلغ المركبة الى البائع بعد نقل الملكية.
          {"\n"}• سداد عربون دخول المزاد 5000 ريال للمزايدة على مركبة واحدة فقط و 10000 ريال للمزايدة على أكثر من مركبة.

          {"\n\n"}☑ يمنع القيام بإصلاحات أو تعديلات على المركبات المتواجدة في ساحة المزاد.
          {"\n"}☑ على المشتري متابعة كافة إجراءات المزاد بنفسه أو وكيل مفوض ينوب عنه، بعد دخوله للمزاد لن يتاح الانسحاب.
          {"\n"}☑ يقر المشتري بأن الشركة غير مسؤولة عن المركبة في حال ظهور أي عيب أو مشكلة حيث أن إدراج بيانات المركبة يكون وفقا لما هو مذكور في رخصة السير،
          والشركة غير مسؤولة عن أي نواقص بالمركبة.

          {"\n\n"}يتم تمديد الوقت الخاص بالمزاد آليًا ثلاث دقائق إضافية في حال تمت المزايدة في الثلاث دقائق الأخيرة.

          {"\n\n"}🟩 انتهاء المزاد:
          {"\n"}إذا فاز المزايد (المشتري) بالمزاد سيتم إشعاره بالفوز ورسو المزاد عليه بالتطبيق، وعند رسو المزاد عليه؛ يعني ذلك أن البيع قد انعقد،
          وتلقائيًا يتم إشعار كلا الطرفين (البائع والمشتري) بعملية البيع واستكمال الإجراءات اللازمة.

          {"\n\n"}🟩 نقل ملكية المركبات:
          {"\n"}نقل ملكية المركبة مسؤولية المشتري وتتم حسب الشروط ولوائح هيئة النقل والمرور.

          {"\n\n"}🟩 تنبيهات على استلام المركبة
        </p>
      </div>
    </div>
  );
};


export default LegalInfo;
